---
kind: method
id: M:Autodesk.Revit.DB.Analysis.EnergyDataSettings.CheckRangeOfPercentageGlazing(System.Double)
source: html/ddb77c33-c1c1-76ad-3068-7b0dd03ff1ca.htm
---
# Autodesk.Revit.DB.Analysis.EnergyDataSettings.CheckRangeOfPercentageGlazing Method

Checks that the percentage glazing value is between 0.00 and 0.95.

## Syntax (C#)
```csharp
public static bool CheckRangeOfPercentageGlazing(
	double percentageGlazing
)
```

## Parameters
- **percentageGlazing** (`System.Double`) - The percentage glazing to be checked.

## Returns
True if the percentage glazing value is between 0.00 and 0.95, false otherwise.